src/cfe/КСП/Catalogs/ПодарочныеСертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПодарочныеСертификаты</Name>
			<Owners>
				<xr:Item>Catalog.ВидыПодарочныхСертификатов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КСП_ШтрихкодЧисловой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МагнитныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Catalogs/ПодарочныеСертификаты/Ext/ObjectModule.bsl
&Перед("ПередЗаписью")
Процедура КСП_ПередЗаписью(Отказ)  
	
	Если НЕ ЗначениеЗаполнено(КСП_ШтрихкодЧисловой) Тогда 
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Штрихкод) Тогда 
			
			КСП_ШтрихкодЧисловой = Число(ЭтотОбъект.Штрихкод);
			
		Иначе
			
			КСП_ШтрихкодЧисловой = Справочники.ПодарочныеСертификаты.СгенерироватьНовыйШтрихкодСертификата();
			
			ЭтотОбъект.Штрихкод = Строка(КСП_ШтрихкодЧисловой);
			
		КонецЕсли;		
		
	Иначе 
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Штрихкод) Тогда 
			
			ЭтотОбъект.Штрихкод = Строка(КСП_ШтрихкодЧисловой);
			
		КонецЕсли;
		
		
	КонецЕсли;


		
			
КонецПроцедуры 

&Перед("ОбработкаПроверкиЗаполнения")
Процедура КСП_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	
	
КонецПроцедуры
